Revit 2026 API

# LightType Properties

---

The LightType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ColorFilter | The light filter color. |
|  | DimmingColor | The dimming temperature value in Kelvins. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

LightType Class

Autodesk.Revit.DB.Lighting Namespace